{
    "name": "Rushikesh Prajapati",
    "title": "Game Developer",
    "itchLink": "https://truti.itch.io",
    "email": "rushikeshprajapati01[at]gmail[dot]com",
    "projects": [
        {
            "name": "MimicFox",
            "link": "https://github.com/ExclusiveRishi/MimicFox",
            "description": "Text-to-Speech extension for Firefox on Linux, enabling read aloud functionality using Mycroft's mimic"
        },
        {
            "name": "Dark Scroll",
            "link": "https://addons.mozilla.org/en-US/firefox/addon/dark-scroll/",
            "description": "Firefox extension that implements a global dark scrollbar theme"
        },
        {
            "name": "Banana Quiz",
            "link": "https://truti.itch.io/bananaquiz",
            "description": "A Platformer Quiz Game"
        },
        {
            "name": "Tower Tumbles",
            "link": "https://truti.itch.io/tower-tumbles",
            "description": "An absurd game where you play as a Tower running away from planes trying to crash into you"
        },
        {
            "name": "Inflatables Demo",
            "link": "https://sardonicstudios.itch.io/inflatables-test",
            "description": "A multiplayer physics game where players control characters made of inflatable primitive shapes",
            "technicalDetails": [
                "Built a fully physics-based character controller with realistic movement, eliminating reliance on animations.",
                "Minimized network traffic and latency using deterministic physics and joint-based character rigs.",
                "Optimized performance for low-end devices with primitive meshes and efficient architecture.",
                "Created all custom assets in Blender after rapid self-training."
            ]
        },
        {
            "name": "Cool Maze Game",
            "link": "https://truti.itch.io/cmg",
            "description": "A multiplayer maze race with funky vector graphics and psychedelic effects",
            "technicalDetails": [
                "Designed a procedural maze system with two meshes and one material, achieving a minimalist vector-style aesthetic",
                "Implemented peer-to-peer multiplayer with zero server cost using Unity's Distributed Authority",
                "Optimized code using Singletons and efficient algorithms for real-time maze generation and pathfinding",
                "Developed custom shaders and original music through self-directed learning"
            ]
        },
        {
            "name": "Daily Journal",
            "link": "https://github.com/ExclusiveRishi/DailyJournal",
            "description": "A minimal journaling app for Windows. One file per day. That's it.",
            "technicalDetails": [
                "Smooth performance on low-power devices.",
                "Auto save functionality based on user input"
            ]
        },
        {
            "name": "Daily Journal Flutter",
            "link": "https://github.com/ExclusiveRishi/daily_journal_flutter",
            "description": "Daily Journal Flutter version"
        }
    ]
}